In [ ]:
#INFORMACIÓN UTIL PARA TRABAJAR CON DATA FRAMES
# 
# 
# import pandas as pd
#df=pd.read_csv("hombres.csv", sep=',')

#aislar una columna
#df['nombre']

#aislar dos columnas
#df[['nombre','edad_media']]

#aislar una fila
#df[df.index==2]

#aislar dos o mas filas
#df[df.index.isin(range(2,10))]

#Leer diferentes archivos: xlsx, json, csv.
#df=pd.read_csv("apellidos.csv", sep=',')
#df=pd.read_excel('Fechas.xlsx')
#df=pd.read_json("poblaciones.json")

#df.head()
#es para obtener una parte de la tabla, una fila [3] o varias [3:8], o unas en concreto [[3,7,12]]

#Para copiar un data frame
#df_hom=df.copy()

#Para localizar en un data frame celdas
#df_hom.loc[[3,7,12]]
#df_hom.loc[100:110, ['nombre', 'frec', ]]
#df_hom.loc[100,['nombre']]
#coger solo los datos en los que la media vale...54.1
# df[df.edad_media == 54.1]

In [25]:
#Creación de 1 único archivo csv que contenga columnas de varios archivos csv, xlsx, json, etc.
#df=pd.DataFrame(combinado1_csv)
#df['combinado_csv']=combinado_csv
#d2f=pd.read_excel('Fechas.xlsx')
#combinado1_csv=pd.DataFrame(df2)
#df=pd.DataFrame(lista,columns=['COLUMNA-'+str(j)]) 
#combina todos los archivos de la lista
#combinado_csv = pd.concat([pd.read_csv(f)])
#exporta a csv
#combinado_csv.to_csv( "combinado_csv.csv", index=False, encoding='utf-8-sig')

#AÑADIR DATOS A UN DATA FRAME COLUMNAS MEJOR DICHO
import pandas as pd
df = pd.DataFrame()
df1=pd.read_csv("hombres.csv", sep=',')
df['NOMBRE'] = df1['nombre']
df2=pd.read_csv("apellidos.csv", sep=',')
df['APELLIDO'] = df2['apellido']
df3=pd.read_json("poblaciones.json")
df['POBLACIÓN'] = df3['Categoria2Valor']
df4 = pd.read_excel("Fechas.xlsx")
df['FECHA-NACIMIENTO'] = df4['Fechas']
df5 = pd.read_excel("Fechas.xlsx")
df['EDAD'] = df5['Edad']

#CONCATENAR-   df=pd.concat([df1,df2,df3,df4,df5],ignore_index=True)

df
#df['colnuv'] = combinado1_csv
#combinado1_csv['nueva']=df['Company']
#print(df)
#combinado1_csv

             NOMBRE    APELLIDO POBLACIÓN     FECHA-NACIMIENTO  EDAD
0           ANTONIO      GARCIA   Euskadi  2023-10-08 00:00:00   1.0
1              JOSE    GONZALEZ  Gipuzkoa           20/05/2018   2.0
2            MANUEL   RODRIGUEZ   Bizkaia  2014-07-09 00:00:00   3.0
3         FRANCISCO   FERNANDEZ     Álava           27/04/1995   4.0
4              JUAN       LOPEZ   Euskadi           24/05/2010   5.0
...             ...         ...       ...                  ...   ...
25437         YUMIN        JORA       NaN                  NaN   NaN
25438   ZAFAR IQBAL      KREMER       NaN                  NaN   NaN
25439  ZBIGNIEW JAN   SARTORIUS       NaN                  NaN   NaN
25440     ZHENGPING        ZAIT       NaN                  NaN   NaN
25441        ZLATAN  PANADEIROS       NaN                  NaN   NaN

[25442 rows x 5 columns]

In [48]:
#programa que me crea una data frame con las culumnas y filas que yo quiera_SIN TERMINAR

import pandas as pd
lista=[]
columns=[]
df=pd.DataFrame(lista)
#lista =['col'+str(1)]
for j in range(3):
    for i in range(3):
        lista.append('col'+str(j)+'dat'+str(i))
    df=pd.DataFrame(lista,columns=['COLUMNA-'+str(j)]) 
    # Agregar una nueva columna al DataFrame
COLUMNA = pd.DataFrame(lista,columns=['COLUMNA-'+str(j)])  
df['COLUM'] = COLUMNA      

df

  COLUMNA-2     COLUM
0  col0dat0  col0dat0
1  col0dat1  col0dat1
2  col0dat2  col0dat2
3  col1dat0  col1dat0
4  col1dat1  col1dat1
5  col1dat2  col1dat2
6  col2dat0  col2dat0
7  col2dat1  col2dat1
8  col2dat2  col2dat2

In [69]:
#programa que me crea una data frame con n filas 
import pandas as pd
n=7
lista=[]
columns=[]
df11=pd.DataFrame(lista)
#lista =['col'+str(1)]

for i in range(n):
        lista.append('dat'+str(i))
df11=pd.DataFrame(lista,columns=['COLUMNA']) 
    # Agregar una nueva columna al DataFrame
COLUMNA = pd.DataFrame(lista,columns=['COLUMNA'])  
df11

  COLUMNA-
0     dat0
1     dat1
2     dat2
3     dat3
4     dat4
5     dat5
6     dat6

In [27]:
#coge n nombres al azar del df de la columna nombre
import pandas as pd
n=3
for i in range(n):
    print(i)
    NOMAZAR=df['NOMBRE'].sample(n=1, random_state=i)
    print(NOMAZAR)

0
22429    MOFADAL
Name: NOMBRE, dtype: object
1
654    ARGIMIRO
Name: NOMBRE, dtype: object
2
3902    ZUHAITZ
Name: NOMBRE, dtype: object

In [84]:
#Crea una lista con n nombres
import pandas as pd
lista=[]
df=pd.DataFrame(lista)
lista.append("col1dat1")
lista.append("col1dat2")
lista.append("col1dat3")
lista

['col1dat1', 'col1dat2', 'col1dat3']

In [41]:
i=2
df['NOMBRE'].sample(n=1, random_state=i)

3902    ZUHAITZ
Name: NOMBRE, dtype: object

In [33]:
#suma de dos data frames
# 
n=2
df4=pd.DataFrame(['A'])
df5=pd.DataFrame(['B'])
df6=df4+df5
df6

    0
0  AB

In [239]:
ser2 = pd.Series([df['NOMBRE'].sample(n=1, random_state=5555)],
                 index = ['USA'])
ser2

USA    6219    MASSAMBA
Name: NOMBRE, dtype: object
dtype: object

In [ ]:
df['EDAD'] = df5['Edad']

In [198]:
#Crea una lista con n nombres
import pandas as pd
lista=[]
df=pd.DataFrame(lista)
lista.append("col1dat1")
lista.append("col1dat2")
lista.append("col1dat3")
lista

['col1dat1', 'col1dat2', 'col1dat3']

In [80]:
#programa para localizar datos de un data frame
d = {'col1': [1, 2], 'col2': [3, 4]}
print(d)
df = pd.DataFrame(data=d)
df.iloc[[0,1]]

{'col1': [1, 2], 'col2': [3, 4]}

   col1  col2
0     1     3
1     2     4

{'col3': [1, 2], 'col4': [3, 4]}